//   Ввести три числа, найти их сумму. 
//   Нужно напечатать сумму трех чисел.
//   Данные на входе:       Три целых числа через пробел
//   Данные на выходе:    Строка вида %d+%d+%d=%d
//   Пример №1: 
//   Данные на входе:        4 5 7
//   Данные на выходе:     4+5+7=16 
//   Пример №2:     
//   Данные на входе:        10 20 30
//   Данные на выходе:    10+20+30=60

#include <stdio.h>
#include <locale.h>
#include <math.h>

int main (int argc, char **argv) 
{
    int a=0,b=0,c=0,d=1;
    setlocale(LC_ALL, "Rus");
    while(d<3){
        printf("Пример №%d: \n",d);
        printf("Введите переменную a b c: \n");
        scanf("%d%d%d",&a,&b,&c);
        printf("Данные на входе: %d %d %d\n",a,b,c);
        printf("Данные на выходе: %d+%d+%d=%d\n",a,b,c,(a+b+c));
        d++;
    }
    return 0;   
}